N=int(input())
dp=[[1]*10 for _ in range(N)]
# 0으로 끝나려면 전 단계에서 0으로 끝난 경우만 가능
# 1로 끝나려면 전단계에서 0~1로 끝난 경우만 가능
# n으로 끝나려면 전단계에서 0~n으로 끝난 경우만 가능

for i in range(1,N):
    dp[i][0]=dp[i-1][0]%10007
    dp[i][1]=sum(dp[i-1][:2])%10007
    dp[i][2]=sum(dp[i-1][:3])%10007
    dp[i][3] = sum(dp[i - 1][:4])%10007
    dp[i][4] = sum(dp[i - 1][:5])%10007
    dp[i][5] = sum(dp[i - 1][:6])%10007
    dp[i][6] = sum(dp[i - 1][:7])%10007
    dp[i][7] = sum(dp[i - 1][:8])%10007
    dp[i][8] = sum(dp[i - 1][:9])%10007
    dp[i][9] = sum(dp[i - 1][:10])%10007

print(sum(dp[N-1])%10007)